lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsStepToneInfo {
  BleCsIqSample pct{};
  uint8_t qualityIndicator = kBleCsToneQualityUnavailable;
  uint8_t extensionIndicator = kBleCsToneExtensionExpected;
};

struct BleCsStepMode2Data {
  uint8_t antennaPermutationIndex = 0U;
  uint8_t toneCount = 0U;
};

struct BleCsStepMode3Data {
  BleCsStepMode1Data timing{};
  uint8_t antennaPermutationIndex = 0U;
  uint8_t toneCount = 0U;
  uint8_t toneDataOffset = 0U;
};

struct BleCsRttSample {
  bool present = false;
  bool valid = false;
  uint8_t aaCheckQuality = 0xFFU;
  uint8_t bitErrors = 0xFFU;
  uint8_t nadm = 0xFFU;
  int8_t packetRssiDbm = 0;
  int16_t timeDifferenceHalfNs = 0;
  uint8_t packetAntenna = 0U;
  uint8_t rawLen = 0U;
  uint8_t rawBytes[8] = {0};
};

struct BleCsChannelMeasurement {
  bool valid = false;
  // 0=ok, 1=invalid setup, 2=control TX, 3=probe TX, 4=report RX,
  // 5=report decode, 6=insufficient tone/RTT quality.
  uint8_t status = 0U;
  uint8_t channelIndex = 0;
  uint8_t sequence = 0;
  uint32_t controlTxUs = 0U;
  uint32_t controlToProbeGapUs = 0U;
  uint32_t probeTxUs = 0U;
  uint32_t reportRxUs = 0U;
  BleCsToneSample localTone;
  BleCsToneSample peerTone;
  BleCsRttSample localRtt;
  BleCsRttSample peerRtt;
  float combinedPhaseRad = 0.0f;
  float rttDistanceMeters = 0.0f;
};

struct BleCsEstimate {
  bool valid = false;
  uint8_t totalToneChannels = 0;
  uint8_t usedChannels = 0;
  uint8_t rttChannels = 0;
  uint8_t rejectedLowQualityChannels = 0;
  uint8_t rejectedResidualChannels = 0;
  float distanceMeters = 0.0f;
  float phaseSlopeDistanceMeters = 0.0f;
  float rttDistanceMeters = 0.0f;
  float slopeRadPerHz = 0.0f;
  float residualVariance = 0.0f;
  float rttVariance = 0.0f;
  float medianToneQuality = 0.0f;
  float fitDeltaMeters = 0.0f;
};

struct BleCsCalibrationProfile {
  float scale = 1.0f;
  float offsetMeters = 0.0f;
  float referenceDistanceMeters = 0.0f;
  float measuredMedianMeters = 0.0f;
  float measuredMadMeters = 0.0f;
  float boardPairBiasMeters = 0.0f;
  float boardPairEquivalentDelayNs = 0.0f;
  float symmetricPerBoardEquivalentDelayNs = 0.0f;
  float validatedMedianMeters = 0.0f;
  float validatedMadMeters = 0.0f;
  float validatedP90AbsErrorMeters = 0.0f;
  uint16_t sampleCount = 0U;
  uint16_t validatedSampleCount = 0U;
};

struct BleCsPhysicalDistanceEstimate {
  bool valid = false;
  float distanceMeters = 0.0f;
  float typicalErrorMeters = 0.0f;
  float conservativeErrorMeters = 0.0f;
  float lowerBoundMeters = 0.0f;
  float upperBoundMeters = 0.0f;
  uint16_t sampleCount = 0U;
};

struct BleCsSubeventResultHeader {
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint16_t startAclConnEventCounter = 0U;
  uint16_t procedureCounter = 0U;
  uint16_t frequencyCompensation = 0U;
  int8_t referencePowerLevelDbm = 0;
  uint8_t procedureDoneStatus = kBleCsProcedureDoneComplete;
  uint8_t subeventDoneStatus = kBleCsSubeventDoneComplete;
  uint8_t procedureAbortReason = 0U;
  uint8_t subeventAbortReason = 0U;
  uint8_t numAntennaPaths = 0U;
  uint16_t numStepsReported = 0U;
};

struct BleCsSubeventResult {
  BleCsSubeventResultHeader header{};
  const uint8_t* stepData = nullptr;
  uint16_t stepDataLen = 0U;
  bool isPartial = false;
  bool isComplete = false;
  bool isContinuation = false;
};

struct BleCsHciCommand {
  uint16_t opcode = 0U;
  uint8_t payload[kBleCsMaxHciCommandPayloadBytes] = {0};
  uint8_t payloadLen = 0U;
};

struct BleCsHciCommandStatusEvent {
  uint8_t status = 0U;
  uint8_t numCommandPackets = 0U;
  uint16_t opcode = 0U;
};

struct BleCsHciCommandCompleteEvent {
  uint8_t status = 0U;
  uint8_t numCommandPackets = 0U;
  uint16_t opcode = 0U;
  const uint8_t* returnParams = nullptr;
  uint8_t returnParamsLen = 0U;
};

struct BleCsHciLeMetaEvent {
  uint8_t subeventCode = 0U;
  const uint8_t* payload = nullptr;
  uint8_t payloadLen = 0U;
};

struct BleCsVprPeerExchangeState {
  bool valid = false;
  uint8_t status = 0xFFU;
  uint8_t previousStage = kBleCsVprPeerStageIdle;
  uint8_t currentStage = kBleCsVprPeerStageIdle;
  uint32_t deadlineHeartbeat = 0U;
  uint8_t procedureAbortReason = 0U;
  uint8_t subeventAbortReason = 0U;
};

class BleCsControllerVprHost;

struct BleCsLlControlBridgeServiceResult {
  bool peerPduConsumed = false;
  bool initiatorPduQueued = false;
  bool initiatorPduSourceVpr = false;
  bool directCommandSent = false;
  bool exchangeComplete = false;
  uint8_t rxOpcode = 0U;
  uint8_t txOpcode = 0U;
  uint8_t directStatus = 0xFFU;
  BleCsVprPeerExchangeState peerState{};
  BleCsVprPeerExchangeState state{};
};

struct BleCsLlControlBridgePollResult {
  bool pollRan = false;
  bool eventStarted = false;
  bool csLlControlReceived = false;
  bool serviceCalled = false;
  bool preServiceCalled = false;
  bool eventServiceCalled = false;
  uint16_t eventCounter = 0U;
  uint8_t rxOpcode = 0U;
  uint8_t rxPayloadLength = 0U;
  BleCsLlControlBridgeServiceResult service{};
  BleCsLlControlBridgeServiceResult preService{};
  BleCsLlControlBridgeServiceResult eventService{};
};

struct BleCsLlControlBridgeWorkflowTracker {
  enum WorkflowBit : uint8_t {
    kWorkflowRemoteCapabilities = 0U,
    kWorkflowDefaults,
    kWorkflowConfig,
    kWorkflowSecurity,
    kWorkflowProcedureParams,
    kWorkflowProcedureEnabled,
    kWorkflowReady,
  };

  enum TxBit : uint8_t {
    kTxCsReq = 0U,
    kTxSecReq,
    kTxProcReq,
  };

  enum RxBit : uint8_t {
    kRxCsRsp = 0U,
    kRxCsCfg,
    kRxSecRsp,
    kRxProcRsp,
    kRxStart,
    kRxAbort,
  };

  uint32_t workflowMask = 0U;
  uint32_t txMask = 0U;
  uint32_t rxMask = 0U;
  uint32_t linkEvents = 0U;
  uint32_t txQueued = 0U;
  uint32_t vprPduQueued = 0U;
  uint32_t peerPdusConsumed = 0U;
  uint32_t directCommands = 0U;
  uint16_t polls = 0U;
  uint16_t completedProcedureCounter = 0U;
  uint32_t localSubeventResults = 0U;
  uint32_t peerSubeventResults = 0U;
  bool resultPathComplete = false;
  bool exchangeComplete = false;
  bool ready = false;
  bool estimateValid = false;
  uint8_t lastRxOpcode = 0U;
  uint8_t lastTxOpcode = 0U;
  uint8_t lastDirectStatus = 0xFFU;
  uint8_t lastVprStage = 0xFFU;
  uint8_t lastVprStatus = 0xFFU;

  void reset();
  void update(const BleCsControllerVprHost& host,
              const BleCsLlControlBridgePollResult& poll);
  bool workflowComplete() const;
  bool txComplete() const;
  bool rxComplete() const;
  bool complete() const;
};

enum class BleCsControllerResultSource : uint8_t {
  kLocal = 0U,
  kPeer,
};

enum class BleCsControllerIngressSource : uint8_t {
  kController = 0U,
  kLocalResult,
  kPeerResult,
};

