lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsControllerCapabilities {
  bool valid = false;
  bool isV2 = false;
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t numConfigSupported = 0U;
  uint16_t maxConsecutiveProceduresSupported = 0U;
  uint8_t numAntennasSupported = 0U;
  uint8_t maxAntennaPathsSupported = 0U;
  bool initiatorSupported = false;
  bool reflectorSupported = false;
  bool mode3Supported = false;
  uint8_t rttCapability = 0U;
  uint8_t rttAaOnlyN = 0U;
  uint8_t rttSoundingN = 0U;
  uint8_t rttRandomPayloadN = 0U;
  uint16_t nadmSoundingCapability = 0U;
  uint16_t nadmRandomCapability = 0U;
  bool csSync2mPhySupported = false;
  bool csSync2m2btPhySupported = false;
  bool csWithoutFaeSupported = false;
  bool chselAlg3cSupported = false;
  bool pbrFromRttSoundingSeqSupported = false;
  bool csIptReflectorSupported = false;
  uint16_t tIp1TimesSupported = 0U;
  uint16_t tIp2TimesSupported = 0U;
  uint16_t tFcsTimesSupported = 0U;
  uint16_t tPmTimesSupported = 0U;
  uint8_t tSwTimeSupported = 0U;
  uint8_t txSnrCapability = 0U;
  uint16_t tIp2IptTimesSupported = 0U;
  uint8_t tSwIptTimeSupported = 0U;
};

struct BleCsDefaultSettings {
  bool enableInitiatorRole = false;
  bool enableReflectorRole = false;
  uint8_t csSyncAntennaSelection = 0xFFU;
  int8_t maxTxPowerDbm = 0;
};

struct BleCsControllerCreateConfig {
  uint8_t configId = 0U;
  uint8_t createContext = 0U;
  uint8_t mainModeType = 0U;
  uint8_t subModeType = 0U;
  uint8_t minMainModeSteps = 0U;
  uint8_t maxMainModeSteps = 0U;
  uint8_t mainModeRepetition = 0U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelMapRepetition = 0U;
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 0U;
  uint8_t csEnhancements1 = 0U;
};

struct BleCsProcedureParameters {
  uint8_t configId = 0U;
  uint16_t maxProcedureLen = 0U;
  uint16_t minProcedureInterval = 0U;
  uint16_t maxProcedureInterval = 0U;
  uint16_t maxProcedureCount = 0U;
  uint32_t minSubeventLen = 0U;
  uint32_t maxSubeventLen = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  uint8_t phy = 0U;
  int8_t txPowerDelta = 0;
  uint8_t preferredPeerAntenna = 0U;
  uint8_t snrControlInitiator = 0U;
  uint8_t snrControlReflector = 0U;
};

struct BleCsProcedureEnable {
  uint8_t configId = 0U;
  uint8_t enable = 0U;
};

struct BleCsSecurityEnableComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
};

struct BleCsConfigComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t action = 0U;
  uint8_t mainModeType = 0U;
  uint8_t subModeType = 0U;
  uint8_t minMainModeSteps = 0U;
  uint8_t maxMainModeSteps = 0U;
  uint8_t mainModeRepetition = 0U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelMapRepetition = 0U;
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 0U;
  uint8_t csEnhancements1 = 0U;
  uint8_t tIp1TimeUs = 0U;
  uint8_t tIp2TimeUs = 0U;
  uint8_t tFcsTimeUs = 0U;
  uint8_t tPmTimeUs = 0U;
};

struct BleCsProcedureEnableComplete {
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  uint8_t configId = 0U;
  uint8_t state = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  int8_t selectedTxPower = 0;
  uint32_t subeventLen = 0U;
  uint8_t subeventsPerEvent = 0U;
  uint16_t subeventInterval = 0U;
  uint16_t eventInterval = 0U;
  uint16_t procedureInterval = 0U;
  uint16_t procedureCount = 0U;
  uint16_t maxProcedureLen = 0U;
};

// ─── Zephyr Parity: CS Test Mode ─────────────────────────────────

struct BleCsTestParams {
  uint8_t mainModeType = kBleCsMainMode2;
  uint8_t subModeType = 0xFFU;
  uint8_t mainModeRepetition = 1U;
  uint8_t mode0Steps = 0U;
  uint8_t role = 0U;
  uint8_t rttType = 0U;
  uint8_t csSyncPhy = 1U;
  uint8_t csSyncAntennaSelection = 0xFFU;
  uint32_t subeventLenUs = 1250U;
  uint16_t subeventInterval = 0U;
  uint8_t maxNumSubevents = 1U;
  uint8_t transmitPowerLevel = 0x7FU;
  uint8_t tIp1TimeUs = 10U;
  uint8_t tIp2TimeUs = 10U;
  uint8_t tFcsTimeUs = 15U;
  uint8_t tPmTimeUs = 10U;
  uint8_t tSwTimeUs = 0U;
  uint8_t toneAntennaConfigSelection = 0U;
  uint8_t csEnhancements1 = 0U;
  uint8_t snrControlInitiator = 0xFFU;
  uint8_t snrControlReflector = 0xFFU;
  uint16_t drbgNonce = 0U;
  uint8_t channelMapRepetition = 1U;
  uint16_t overrideConfig = 0U;

  // Override 0 always contributes data: a channel list when bit 0 is set,
  // otherwise a channel map and channel-selection parameters.
  uint8_t overrideChannelList[kBleCsMaxTestChannelCount] = {0};
  uint8_t overrideChannelListLen = 0U;
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
  uint8_t channelSelectionType = 0U;
  uint8_t ch3cShape = 0U;
  uint8_t ch3cJump = 2U;

  uint8_t overrideMainModeSteps = 0U;
  uint8_t overrideTpmToneExtension = 0U;
  uint8_t overrideToneAntennaPermutationIndex = 0U;
  uint32_t overrideCsSyncAccessAddressInitiator = 0U;
  uint32_t overrideCsSyncAccessAddressReflector = 0U;
  uint8_t overrideSsMarkerPositions[2] = {0};
  uint8_t overrideSsMarkerValue = 0U;
  uint8_t overrideCsSyncPayloadPattern = 0U;
  uint8_t overrideCsSyncUserPayload[16] = {0};
};

struct BleCsTestEndComplete {
  uint8_t status = 0U;
};

using BleCsTestComplete = BleCsTestEndComplete;

// ─── Zephyr Parity: Channel Classification ───────────────────────

struct BleCsChannelClassification {
  uint8_t channelMap[kBleCsChannelMapBytes] = {0};
};

// ─── Zephyr Parity: FAE Table ────────────────────────────────────

struct BleCsFaeTable {
  bool valid = false;
  uint8_t status = 0U;
  uint16_t connHandle = 0U;
  int8_t values[kBleCsFaeTableValueCount] = {0};
};

// ─── Zephyr Parity: Cached Capabilities ──────────────────────────

struct BleCsCachedCapabilities {
  uint16_t connHandle = 0U;
  BleCsControllerCapabilities capabilities{};
};

enum class BleCsControllerWorkflowPhase : uint8_t {
  kIdle = 0U,
  kNeedReadRemoteCapabilities,
  kWaitingRemoteCapabilities,
  kNeedSetDefaultSettings,
  kWaitingSetDefaultSettings,
  kNeedCreateConfig,
  kWaitingConfigComplete,
  kNeedSecurityEnable,
  kWaitingSecurityEnableComplete,
  kNeedSetProcedureParameters,
  kWaitingSetProcedureParameters,
  kNeedProcedureEnable,
  kWaitingProcedureEnableComplete,
  kReady,
  kFailed,
};

struct BleCsControllerWorkflowConfig {
  BleCsDefaultSettings defaultSettings{};
  BleCsControllerCreateConfig createConfig{};
  BleCsProcedureParameters procedureParameters{};
  BleCsProcedureEnable procedureEnable{};
  bool applyDefaultSettings = true;
  bool requireSecurityEnable = true;
};

