lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
struct BleCsControllerWorkflowState {
  BleCsControllerWorkflowPhase phase = BleCsControllerWorkflowPhase::kIdle;
  uint16_t connHandle = 0U;
  uint16_t lastOpcode = 0U;
  uint8_t lastStatus = 0U;
  bool remoteCapabilitiesValid = false;
  bool defaultSettingsApplied = false;
  bool configCreated = false;
  bool securityEnabled = false;
  bool procedureParametersApplied = false;
  bool procedureEnabled = false;
  BleCsControllerCapabilities remoteCapabilities{};
  BleCsConfigComplete configComplete{};
  BleCsProcedureEnableComplete procedureEnableComplete{};
};

struct BleCsConfig {
  uint32_t accessAddress = 0xA7DCE5B3UL;
  uint32_t crcInit = 0x445566UL;
  int8_t txPowerDbm = NRF54L15_CLEAN_BLE_DEFAULT_TX_DBM;
  uint8_t cteTimeUnits = 10U;
  uint8_t maxPayloadLength = 32U;
  uint8_t s0Pattern = 0xA5U;
  uint8_t controlChannel = 37U;
  uint16_t controlToProbeDelayUs = 2400U;
  uint16_t probeToReportDelayUs = 1200U;
  uint16_t controlListenWindowUs = 20000U;
  uint16_t probeListenWindowUs = 8000U;
  uint16_t responseListenWindowUs = 12000U;
  uint8_t probeRetries = 4U;
  uint16_t minToneMagnitude = 16U;
  // Bare RADIO RTT AUXDATA layout/channel semantics are not publicly documented
  // well enough to decode reliable ranging results in this clean-core path.
  bool enableRtt = false;
  bool rttFullAccessAddress = true;
  uint8_t rttNumSegments = 0U;
  uint16_t rttEfsDelay = 64U;
  float rttDistanceOffsetMeters = 0.0f;
  bool enableRawDfeCapture = false;
  uint8_t dfeSwitchPatternCount = 0U;
  uint8_t dfeSwitchPattern[kBleCsMaxSwitchPatternCount] = {0};
  uint8_t dfeRepeatPattern = 0U;
  int16_t dfeSwitchOffset16M = 0;
  int16_t dfeSampleOffset16M = 0;
};

struct BleCsConnectedWindowPlan {
  bool valid = false;
  bool connected = false;
  bool fits = false;
  BleConnectionRole role = BleConnectionRole::kNone;
  uint16_t nextEventCounter = 0U;
  uint16_t intervalUnits = 0U;
  uint32_t intervalUs = 0U;
  uint32_t nowUs = 0U;
  uint32_t nextEventUs = 0U;
  uint32_t timeUntilNextEventUs = 0U;
  uint32_t startUs = 0U;
  uint32_t deadlineUs = 0U;
  uint32_t availableUs = 0U;
  uint32_t requestedWindowUs = 0U;
  uint32_t guardBeforeUs = 0U;
  uint32_t guardAfterUs = 0U;
  uint8_t reason = 0U;
};

struct BleCsConnectedWindowMeasurement {
  BleCsConnectedWindowPlan plan{};
  BleCsChannelMeasurement measurement{};
  bool attempted = false;
  bool measured = false;
  bool completedBeforeDeadline = false;
  uint8_t channelIndex = 0U;
  uint8_t sequence = 0U;
  uint32_t startDelayUs = 0U;
  uint32_t elapsedUs = 0U;
  uint32_t remainingUs = 0U;
  uint8_t reason = 0U;
};

struct BleCsReflectorTiming {
  uint32_t controlRxUs = 0U;
  uint32_t controlToProbeRxGapUs = 0U;
  uint32_t probeRxUs = 0U;
  uint32_t probeToReportGapUs = 0U;
  uint32_t reportTxUs = 0U;
};

class BleChannelSoundingRadio {
 public:
  explicit BleChannelSoundingRadio(uint32_t radioBase = nrf54l15::RADIO_BASE);

  bool begin(const BleCsConfig& config = BleCsConfig());
  void end();

  bool initialized() const;
  const BleCsConfig& config() const;
  uint8_t lastReflectorStatus() const;
  BleCsReflectorTiming lastReflectorTiming() const;

  bool measureChannel(uint8_t channelIndex, uint8_t sequence,
                      BleCsChannelMeasurement* outMeasurement);
  bool measureConnectedWindowChannel(
      const BleConnectionTimingSnapshot& snapshot,
      uint8_t channelIndex,
      uint8_t sequence,
      uint32_t requestedWindowUs,
      uint32_t guardBeforeUs,
      uint32_t guardAfterUs,
      BleCsConnectedWindowMeasurement* outMeasurement);
  bool measureMode2Sweep(uint8_t channelCount,
                         uint8_t* inOutSequence,
                         BleCsChannelMeasurement* outMeasurements,
                         uint8_t* outValidChannels = nullptr,
                         uint16_t interChannelGuardUs = 120U);
  bool listenAndReflectOnce(uint32_t controlListenWindowUs = 0U);

  static uint8_t centeredDataChannelAt(uint8_t order,
                                       uint8_t channelCount = 37U);
  static bool planConnectedWindow(
      const BleConnectionTimingSnapshot& snapshot,
      uint32_t requestedWindowUs,
      uint32_t guardBeforeUs,
      uint32_t guardAfterUs,
      BleCsConnectedWindowPlan* outPlan);
  static float combinedPhaseRad(const BleCsChannelMeasurement& measurement);
  static bool rttDistanceMeters(const BleCsChannelMeasurement& measurement,
                                float* outDistanceMeters);
  static bool estimateDistancePhaseSlope(const BleCsChannelMeasurement* measurements,
                                         size_t count,
                                         BleCsEstimate* outEstimate);
  static float applyCalibrationProfile(float meters,
                                       const BleCsCalibrationProfile& profile);
  static bool estimatePhysicalDistance(float meters,
                                       const BleCsCalibrationProfile& profile,
                                       BleCsPhysicalDistanceEstimate* outEstimate);
  static float distanceMetersToEquivalentDelayNs(float meters);
  static float equivalentDelayNsToDistanceMeters(float delayNs);
  static BleCsIqSample parsePctSample(const uint8_t pct[3]);
  static void fillValidChannelMap(uint8_t channelMap[kBleCsChannelMapBytes]);
  static bool getAntennaPathPermutation(uint8_t antennaPathCount,
                                        uint8_t permutationIndex,
                                        uint8_t toneIndex,
                                        uint8_t* outAntennaId);
  static bool parseMode1StepData(const BleCsSubeventStep* step,
                                 BleCsStepMode1Data* outData);
  static bool parseMode2StepData(const BleCsSubeventStep* step,
                                 BleCsStepMode2Data* outData);
  static bool parseMode3StepData(const BleCsSubeventStep* step,
                                 BleCsStepMode3Data* outData);
  static bool parseToneInfo(const uint8_t* toneData,
                            size_t toneDataLen,
                            BleCsStepToneInfo* outInfo);
  static bool parseMode2ToneInfo(const BleCsSubeventStep* step,
                                 uint8_t toneIndex,
                                 BleCsStepToneInfo* outInfo);
  static bool parseMode3ToneInfo(const BleCsSubeventStep* step,
                                 uint8_t toneIndex,
                                 BleCsStepToneInfo* outInfo);
  static void parseSubeventStepData(const uint8_t* stepData,
                                    size_t stepDataLen,
                                    bool (*callback)(const BleCsSubeventStep* step,
                                                     void* userData),
                                    void* userData);
  static bool encodeMode2StepDataFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      bool peerSide,
      uint8_t* outStepData,
      size_t maxStepDataLen,
      size_t* outStepDataLen,
      uint16_t* outStepsEncoded);
  static bool buildMode2SubeventResultFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      bool peerSide,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* outStepData,
      size_t maxStepDataLen,
      BleCsSubeventResult* outResult);
  static bool estimateDistanceFromStepBuffers(const uint8_t* localStepData,
                                              size_t localStepDataLen,
                                              const uint8_t* peerStepData,
                                              size_t peerStepDataLen,
                                              bool localRoleIsInitiator,
                                              BleCsEstimate* outEstimate);
  static bool parseHciSubeventResultEvent(const uint8_t* eventData,
                                          size_t eventLen,
                                          BleCsSubeventResult* outResult);
  static bool parseHciSubeventResultContinueEvent(const uint8_t* eventData,
                                                  size_t eventLen,
                                                  BleCsSubeventResult* outResult);
  static bool estimateDistanceFromSubeventResults(const BleCsSubeventResult& localResult,
                                                  const BleCsSubeventResult& peerResult,
                                                  bool localRoleIsInitiator,
                                                  BleCsEstimate* outEstimate);
  static bool buildHciReadRemoteSupportedCapabilitiesCommand(
      uint16_t connHandle, BleCsHciCommand* outCommand);
  static bool buildHciSetDefaultSettingsCommand(
      uint16_t connHandle, const BleCsDefaultSettings& settings, BleCsHciCommand* outCommand);
  static bool buildHciCreateConfigCommand(uint16_t connHandle,
                                          const BleCsControllerCreateConfig& config,
                                          BleCsHciCommand* outCommand);
  static bool buildHciRemoveConfigCommand(uint16_t connHandle,
                                          uint8_t configId,
                                          BleCsHciCommand* outCommand);
  static bool buildHciSecurityEnableCommand(uint16_t connHandle,
                                            BleCsHciCommand* outCommand);
  static bool buildHciSetProcedureParametersCommand(
      uint16_t connHandle,
      const BleCsProcedureParameters& params,
      BleCsHciCommand* outCommand);
  static bool buildHciProcedureEnableCommand(uint16_t connHandle,
                                             const BleCsProcedureEnable& params,
                                             BleCsHciCommand* outCommand);
  static bool encodeHciCommandPacket(const BleCsHciCommand& command,
                                     uint8_t* outPacket,
                                     size_t maxLen,
                                     size_t* outLen);
  static bool parseHciCommandStatusEvent(const uint8_t* packet,
                                         size_t packetLen,
                                         BleCsHciCommandStatusEvent* outEvent);
  static bool parseHciCommandCompleteEvent(const uint8_t* packet,
                                           size_t packetLen,
                                           BleCsHciCommandCompleteEvent* outEvent);
  static bool parseHciLeMetaEvent(const uint8_t* packet,
                                  size_t packetLen,
                                  BleCsHciLeMetaEvent* outEvent);
  static bool parseHciRemoteSupportedCapabilitiesCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsControllerCapabilities* outCapabilities);
  static bool parseHciRemoteSupportedCapabilitiesCompleteV2Event(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsControllerCapabilities* outCapabilities);
  static bool parseHciSecurityEnableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsSecurityEnableComplete* outEvent);
  static bool parseHciConfigCompleteEvent(const uint8_t* eventData,
                                          size_t eventLen,
                                          BleCsConfigComplete* outEvent);
  static bool parseHciProcedureEnableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsProcedureEnableComplete* outEvent);

  // ─── Zephyr Parity: CS Test Mode HCI ───────────────────────
  static bool buildHciTestCommand(const BleCsTestParams& params,
                                  BleCsHciCommand* outCommand);
  static bool buildHciTestCommand(uint16_t unusedConnHandle,
                                  const BleCsTestParams& params,
                                  BleCsHciCommand* outCommand);
  static bool buildHciTestEndCommand(BleCsHciCommand* outCommand);
  static bool parseHciTestEndCompleteEvent(const uint8_t* eventData,
                                           size_t eventLen,
                                           BleCsTestEndComplete* outEvent);
  static bool parseHciTestCompleteEvent(const uint8_t* eventData,
                                         size_t eventLen,
                                         BleCsTestComplete* outEvent);

  // ─── Zephyr Parity: Channel Classification HCI ─────────────
  static bool buildHciSetChannelClassificationCommand(
      const BleCsChannelClassification& classification,
      BleCsHciCommand* outCommand);

