lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
  // ─── Zephyr Parity: FAE Table HCI ──────────────────────────
  static bool buildHciReadRemoteFaeTableCommand(uint16_t connHandle,
                                                 BleCsHciCommand* outCommand);
  static bool parseHciReadRemoteFaeTableCompleteEvent(
      const uint8_t* eventData,
      size_t eventLen,
      BleCsFaeTable* outTable);
  static bool buildHciWriteCachedRemoteFaeTableCommand(
      uint16_t connHandle,
      const int8_t faeTable[kBleCsFaeTableValueCount],
      BleCsHciCommand* outCommand);

  // ─── Zephyr Parity: Cached Capabilities HCI ────────────────
  static bool buildHciWriteCachedRemoteSupportedCapabilitiesCommand(
      uint16_t connHandle,
      const BleCsControllerCapabilities& capabilities,
      BleCsHciCommand* outCommand);
  static bool buildHciWriteCachedRemoteSupportedCapabilitiesV2Command(
      uint16_t connHandle,
      const BleCsControllerCapabilities& capabilities,
      BleCsHciCommand* outCommand);

  BleCsDfeCaptureInfo lastDfeCaptureInfo() const;
  bool copyLastDfePacket(uint8_t* outPacket,
                         size_t maxLen,
                         size_t* outLen) const;

 private:
  enum class PacketType : uint8_t {
    kControl = 0x43U,
    kProbe = 0x50U,
    kReport = 0x52U,
  };

  struct RxFrame {
    bool valid = false;
    PacketType type = PacketType::kControl;
    uint8_t sequence = 0;
    uint8_t channelIndex = 0;
    uint8_t flags = 0;
    int8_t rssiDbm = 0;
    uint8_t extra[24] = {0};
    uint8_t extraLen = 0;
  };

  bool configureBle2MCommon();
  bool setLogicalChannel(uint8_t channelIndex);
  void configureRtt(bool enabled, bool reflectorRole);
  void prepareAuxDataCapture();
  void configureTxToneExtension();
  void configureRxToneCapture();
  void clearEvents();
  bool sendFrame(uint8_t logicalChannel,
                 PacketType type,
                 uint8_t sequence,
                 uint8_t channelIndex,
                 uint8_t flags,
                 const uint8_t* extra,
                 uint8_t extraLen,
                 bool enableRtt,
                 bool rttReflectorRole);
  bool receiveFrame(uint8_t logicalChannel,
                    uint32_t listenWindowUs,
                    bool captureTone,
                    bool captureRtt,
                    bool rttReflectorRole,
                    RxFrame* outFrame,
                    BleCsToneSample* outTone,
                    BleCsRttSample* outRtt);
  bool decodeFrame(const uint8_t* packet,
                   size_t packetLen,
                   int8_t rssiDbm,
                   RxFrame* outFrame) const;
  void encodeReportExtra(const BleCsToneSample& tone, uint8_t* outExtra) const;
  void decodeReportExtra(const uint8_t* extra,
                         uint8_t extraLen,
                         BleCsToneSample* outTone) const;
  void encodeRttExtra(const BleCsRttSample& rtt, uint8_t* outExtra) const;
  void decodeRttExtra(const uint8_t* extra,
                      uint8_t extraLen,
                      BleCsRttSample* outRtt) const;
  void captureAuxDataRtt(BleCsRttSample* outRtt);
  void resetDfeCaptureState();
  void updateDfeCaptureState();
  bool deriveToneFromRawDfe(BleCsToneSample* outTone) const;
  void parseRttRaw(BleCsRttSample* outRtt) const;
  uint8_t makeCteInfo() const;

  NRF_RADIO_Type* radio_;
  PowerManager power_;
  BleCsConfig config_;
  bool initialized_;
  alignas(4) uint8_t txPacket_[3U + 48U];
  alignas(4) uint8_t rxPacket_[3U + 48U];
  alignas(4) uint8_t dfePacket_[512U];
  alignas(4) uint32_t auxDataWords_[4];
  uint16_t lastDfePacketAmountBytes_;
  uint16_t lastDfePacketCurrentAmountBytes_;
  bool lastDfePacketAllZero_;
  uint8_t lastReflectorStatus_;
  BleCsReflectorTiming lastReflectorTiming_;
};

struct BleCsConnectedMode2SweepConfig {
  const uint8_t* channels = nullptr;
  uint8_t channelCount = 0U;
  uint8_t minValidChannels = 1U;
  uint8_t configId = 1U;
  uint8_t numAntennaPaths = 1U;
  uint8_t triggerReason = 0x7EU;
  uint8_t ackReason = 0x7DU;
  uint8_t windowEventOffset = 4U;
  uint8_t triggerAckPolls = 6U;
  uint8_t startEventPollSlack = 4U;
  uint32_t singleChannelWindowUs = 14000UL;
  uint32_t guardBeforeUs = 4000UL;
  uint32_t guardAfterUs = 4500UL;
  uint32_t pollSpinLimit = 450000UL;
  BoardAntennaPath antennaPath = BoardAntennaPath::kCeramic;
  BleCsConfig radioConfig{};
  uint8_t* inOutSequence = nullptr;
};

struct BleCsConnectedMode2ChannelResult {
  BleCsConnectedWindowMeasurement window{};
  BleCsDfeCaptureInfo dfeInfo{};
  uint8_t channel = 0U;
  uint8_t order = 0U;
  bool triggerQueued = false;
  bool triggerSent = false;
  bool triggerAcked = false;
  bool startEventSeen = false;
  bool rfPathEnabled = false;
  bool radioStarted = false;
  bool snapshotValid = false;
  bool channelOk = false;
  uint16_t triggerEventCounter = 0U;
  uint16_t ackEventCounter = 0U;
  uint16_t runAfterEventCounter = 0U;
  uint8_t reason = 0U;
};

struct BleCsConnectedMode2SweepResult {
  bool ok = false;
  bool rawEstimateValid = false;
  bool hostEstimateValid = false;
  uint8_t attempts = 0U;
  uint8_t validChannels = 0U;
  uint16_t hostLocalSteps = 0U;
  uint16_t hostPeerSteps = 0U;
  BleCsEstimate rawEstimate{};
  BleCsConnectedMode2ChannelResult lastChannel{};
};

using BleCsConnectedMode2ChannelCallback =
    void (*)(const BleCsConnectedMode2ChannelResult& result,
             void* userData);

class BleCsConnectedMode2SweepRunner {
 public:
  static bool runInitiator(
      BleRadio& ble,
      BleChannelSoundingRadio& radio,
      BleCsControllerVprHost* host,
      const BleCsConnectedMode2SweepConfig& config,
      BleCsChannelMeasurement* measurements,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen,
      BleCsConnectedMode2SweepResult* outResult,
      BleCsConnectedMode2ChannelCallback channelCallback = nullptr,
      void* channelCallbackUserData = nullptr);
};

class BleCsSubeventResultReassembler {
 public:
  BleCsSubeventResultReassembler();

  void reset();
  bool active() const;

  bool consumeInitialEvent(const uint8_t* eventData,
                           size_t eventLen,
                           BleCsSubeventResult* outResult);
  bool consumeContinuationEvent(const uint8_t* eventData,
                                size_t eventLen,
                                BleCsSubeventResult* outResult);

