lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/ble_channel_sounding.h
  bool retainedConfigMatchesRunnability(bool selectedRunnable,
                                        bool slot0Runnable,
                                        bool slot1Runnable,
                                        bool previousRunnable) const {
    return linkSelectedConfigRunnable == selectedRunnable &&
           linkSlot0Runnable == slot0Runnable &&
           linkSlot1Runnable == slot1Runnable &&
           linkPreviousSlotRunnable == previousRunnable;
  }

  bool retainedConfigMatchesSelection(uint8_t activeConfigId,
                                      uint8_t slot0ConfigId,
                                      uint8_t slot1ConfigId,
                                      uint8_t previousConfigId,
                                      uint8_t storedConfigCount,
                                      bool selectedRunnable,
                                      bool previousRunnable) const {
    return linkConfigId == activeConfigId &&
           linkSlot0ConfigId == slot0ConfigId &&
           linkSlot1ConfigId == slot1ConfigId &&
           linkPreviousConfigId == previousConfigId &&
           linkSlot0InUse == (slot0ConfigId != 0U) &&
           linkSlot1InUse == (slot1ConfigId != 0U) &&
           linkPreviousSlotInUse == (previousConfigId != 0U) &&
           linkStoredConfigCount == storedConfigCount &&
           linkSelectedConfigRunnable == selectedRunnable &&
           linkPreviousSlotRunnable == previousRunnable;
  }

  bool retainedConfigMatchesReadiness(bool selectedSecurityEnabled,
                                      bool slot0SecurityEnabled,
                                      bool slot1SecurityEnabled,
                                      bool previousSecurityEnabled,
                                      bool selectedProcedureParamsApplied,
                                      bool slot0ProcedureParamsApplied,
                                      bool slot1ProcedureParamsApplied,
                                      bool previousProcedureParamsApplied) const {
    return linkSelectedConfigSecurityEnabled == selectedSecurityEnabled &&
           linkSlot0SecurityEnabled == slot0SecurityEnabled &&
           linkSlot1SecurityEnabled == slot1SecurityEnabled &&
           linkPreviousSlotSecurityEnabled == previousSecurityEnabled &&
           linkSelectedConfigProcedureParamsApplied ==
               selectedProcedureParamsApplied &&
           linkSlot0ProcedureParamsApplied == slot0ProcedureParamsApplied &&
           linkSlot1ProcedureParamsApplied == slot1ProcedureParamsApplied &&
           linkPreviousSlotProcedureParamsApplied ==
               previousProcedureParamsApplied;
  }

  bool retainedConfigMatchesAuthority(uint8_t authority0ConfigId,
                                      uint8_t authority1ConfigId,
                                      uint8_t authority2ConfigId) const {
    return linkAuthority0ConfigId == authority0ConfigId &&
           linkAuthority1ConfigId == authority1ConfigId &&
           linkAuthority2ConfigId == authority2ConfigId;
  }

  uint32_t retainedConfigAuthorityWord() const {
    return static_cast<uint32_t>(linkAuthority0ConfigId) |
           (static_cast<uint32_t>(linkAuthority1ConfigId) << 8U) |
           (static_cast<uint32_t>(linkAuthority2ConfigId) << 16U);
  }

  bool selectedStateMatches(
      const BleCsControllerVprSelectedStateExpectation& expected) const {
    return linkSessionOpen && linkConfigCreated &&
           linkConfigId == expected.selectedConfigId &&
           linkStoredConfigCount == expected.storedConfigCount &&
           linkSelectedConfigRunnable == expected.selectedRunnable &&
           !linkProcedureEnabled;
  }

  bool retainedConfigMatches(
      const BleCsControllerVprRetainedSelectionExpectation& expected) const {
    return retainedConfigMatchesSelection(expected.activeConfigId,
                                          expected.slot0ConfigId,
                                          expected.slot1ConfigId,
                                          expected.previousConfigId,
                                          expected.storedConfigCount,
                                          expected.selectedRunnable,
                                          expected.previousRunnable) &&
           (!expected.checkLastEvictedConfigId ||
            linkLastEvictedConfigId == expected.lastEvictedConfigId);
  }

  bool retainedConfigMatches(
      const BleCsControllerVprRetainedSlotsExpectation& expected) const {
    return retainedConfigMatchesSlots(expected.activeConfigId,
                                      expected.slot0ConfigId,
                                      expected.slot1ConfigId,
                                      expected.previousConfigId,
                                      expected.activePrimarySlotIndex,
                                      expected.freePrimarySlotCount,
                                      expected.storedConfigCount);
  }

  bool retainedConfigMatches(
      const BleCsControllerVprRetainedRunnabilityExpectation& expected) const {
    return retainedConfigMatchesRunnability(expected.selectedRunnable,
                                           expected.slot0Runnable,
                                           expected.slot1Runnable,
                                           expected.previousRunnable);
  }

  bool retainedConfigMatches(
      const BleCsControllerVprRetainedReadinessExpectation& expected) const {
    return retainedConfigMatchesReadiness(expected.selectedSecurityEnabled,
                                          expected.slot0SecurityEnabled,
                                          expected.slot1SecurityEnabled,
                                          expected.previousSecurityEnabled,
                                          expected.selectedProcedureParamsApplied,
                                          expected.slot0ProcedureParamsApplied,
                                          expected.slot1ProcedureParamsApplied,
                                          expected.previousProcedureParamsApplied);
  }

  bool retainedConfigMatches(
      const BleCsControllerVprRetainedStateExpectation& expected) const {
    return retainedConfigMatches(expected.slots) &&
           (!expected.checkRunnability ||
            retainedConfigMatches(expected.runnability)) &&
           (!expected.checkReadiness ||
            retainedConfigMatches(expected.readiness)) &&
           (!expected.checkLastEvictedConfigId ||
            linkLastEvictedConfigId == expected.lastEvictedConfigId);
  }
};

class BleCsControllerVprHost {
 public:
  BleCsControllerVprHost();
  static void fillDemoConfig(BleCsControllerVprHostConfig* outConfig);

  void reset();
  bool resetTransport(bool clearScripts = true);
  bool addScriptResponse(uint16_t opcode, const uint8_t* response, size_t len);
  bool loadDefaultTransportImage();
  bool bootTransport(uint32_t readySpinLimit = 100000UL);
  bool refreshLinkSession();
  /* Parity item #3: detect BLE disconnect and clean CS state. Returns true
   * when session was open and has now been cleaned. */
  bool handleDisconnect();
  bool beginHost(uint16_t connHandle, const BleCsControllerVprHostConfig& config);
  bool beginFreshHost(uint16_t connHandle,
                      const BleCsControllerVprHostConfig& config,
                      uint8_t maxPumpCount,
                      uint8_t* outPumpCount);
  bool beginFreshHostFromBleConnection(
      VprControllerServiceHost& sourceService,
      const BleCsControllerVprHostConfig& config,
      uint8_t maxPumpCount,
      uint8_t* outPumpCount,
      VprBleConnectionSharedState* outImportedState = nullptr,
      uint32_t sourceStateTimeoutMs = 2500UL);
  bool beginFreshWorkflowFromBleConnection(
      VprControllerServiceHost& sourceService,
      const BleCsControllerVprHostConfig& config,
      bool enableProcedure,
      uint8_t maxPumpCount,
      uint8_t* outPumpCount,
      VprBleConnectionSharedState* outImportedState = nullptr,
      BleCsControllerVprWorkflowStartStatus* outWorkflowStatus = nullptr,
      uint32_t sourceStateTimeoutMs = 2500UL);
  bool sendDirectHciCommand(uint16_t opcode,
                            const uint8_t* params,
                            size_t paramsLen,
                            uint8_t* response,
                            size_t responseSize,
                            size_t* responseLen);
  bool directStartConfiguredWorkflow(
      bool enableProcedure,
      BleCsControllerVprWorkflowStartStatus* outWorkflowStatus = nullptr);
  bool directReadRemoteSupportedCapabilities(uint8_t* outStatus);
  bool directWriteCachedRemoteSupportedCapabilities(
      const BleCsControllerCapabilities& capabilities,
      uint8_t* outStatus);
  bool directWriteCachedRemoteSupportedCapabilitiesV2(
      const BleCsControllerCapabilities& capabilities,
      uint8_t* outStatus);
  bool directReadRemoteFaeTable(BleCsFaeTable* outTable, uint8_t* outStatus);
  bool directWriteCachedRemoteFaeTable(
      const int8_t faeTable[kBleCsFaeTableValueCount],
      uint8_t* outStatus);
  bool directSetChannelClassification(
      const BleCsChannelClassification& classification,
      uint8_t* outStatus);
  bool directStartTest(const BleCsTestParams& params, uint8_t* outStatus);
  bool directStopTest(BleCsTestEndComplete* outComplete, uint8_t* outStatus);
  bool directSetDefaultSettings(const BleCsDefaultSettings& settings, uint8_t* outStatus);
  bool directCreateConfig(const BleCsControllerCreateConfig& config, uint8_t* outStatus);
  bool directRemoveConfig(uint8_t configId, uint8_t* outStatus);
  bool directSecurityEnable(uint8_t* outStatus);
  bool directSetProcedureParameters(const BleCsProcedureParameters& params,
                                    uint8_t* outStatus);
  bool directProcedureEnable(const BleCsProcedureEnable& params, uint8_t* outStatus);
  bool directProcedureEnable(uint8_t configId, bool enable, uint8_t* outStatus);
  bool directCurrentProcedureEnable(bool enable, uint8_t* outStatus);
  bool directInjectPeerPduForTest(const uint8_t* pdu,
                                  size_t pduLen,
                                  BleCsVprPeerExchangeState* outState);
  bool directReadPeerExchangeStateForTest(BleCsVprPeerExchangeState* outState);
  bool directReadPendingLocalLlControlPduForTest(
      BleCsLlControlPdu* outPdu,
      BleCsVprPeerExchangeState* outState);
  bool buildPendingInitiatorLlControlPdu(
      BleCsLlControlPdu* outPdu,
      BleCsVprPeerExchangeState* outState = nullptr,
      bool* outVprOwned = nullptr);
  bool queuePendingInitiatorLlControlPdu(
      BleRadio& radio,
      BleCsVprPeerExchangeState* outState = nullptr,
      BleCsLlControlPdu* outPdu = nullptr,
      bool* outVprOwned = nullptr);
  bool consumePeerLlControlPdu(const uint8_t* payload,
                               uint8_t length,
                               BleCsVprPeerExchangeState* outState);
  bool consumePeerLlControlPduFromEvent(const BleConnectionEvent& event,
                                        BleCsVprPeerExchangeState* outState);
  bool serviceInitiatorLlControlBridge(
      BleRadio& radio,
      const BleConnectionEvent* event,
      BleCsLlControlBridgeServiceResult* outResult = nullptr);
  bool pollInitiatorLlControlBridge(
      BleRadio& radio,
      BleCsLlControlBridgePollResult* outResult = nullptr,
      uint32_t spinLimit = 400000UL);
  bool pollUntilRunningWithProcedureCount(uint16_t targetProcedureCount,
                                          uint8_t maxPolls,
                                          uint8_t* outPolls);
  bool pollUntilStopped(uint8_t maxPolls, uint8_t* outPolls);
  bool pollUntilStoppedWithProcedureCount(uint16_t targetProcedureCount,
                                          uint8_t maxPolls,
                                          uint8_t* outPolls);
  bool pollUntilStoppedOnConfig(uint8_t targetConfigId,
                                uint8_t maxPolls,
                                uint8_t* outPolls);
  bool pollUntilRunComplete(uint32_t targetLocalSubevents,
                            uint32_t targetPeerSubevents,
                            uint8_t maxPolls,
                            uint8_t* outPolls);
  bool pollUntilCompletedProcedureResult(uint16_t targetProcedureCount,
                                         uint32_t targetLocalSubevents,
                                         uint32_t targetPeerSubevents,
                                         uint8_t maxPolls,
                                         uint8_t* outPolls);
  bool pollUntilSelectedState(uint8_t selectedConfigId,
                              uint8_t storedCount,
                              bool selectedRunnable,
                              uint8_t maxPolls,
                              uint8_t* outPolls);
  bool pollUntilSelectedState(
      const BleCsControllerVprSelectedStateExpectation& expected,
      uint8_t maxPolls,
      uint8_t* outPolls);
  bool pollUntilRetainedSelectionState(uint8_t activeConfigId,
                                       uint8_t slot0ConfigId,
                                       uint8_t slot1ConfigId,
                                       uint8_t previousConfigId,
                                       uint8_t storedConfigCount,
                                       bool selectedRunnable,
                                       bool previousRunnable,
                                       uint8_t maxPolls,
                                       uint8_t* outPolls);
  bool pollUntilRetainedSelectionState(
      const BleCsControllerVprRetainedSelectionExpectation& expected,
      uint8_t maxPolls,
      uint8_t* outPolls);
  bool settleDirectIdle(uint8_t stablePollsRequired,
                        uint8_t maxPolls,
                        uint8_t* outPolls);
  bool pollUntilRetainedSlots(uint8_t activeConfigId,
                              uint8_t slot0ConfigId,
                              uint8_t slot1ConfigId,
                              uint8_t previousConfigId,
                              uint8_t activePrimarySlotIndex,
                              uint8_t freePrimarySlotCount,
                              uint8_t storedConfigCount,
                              uint8_t maxPolls,
                              uint8_t* outPolls);
  bool pollUntilRetainedSlots(
      const BleCsControllerVprRetainedSlotsExpectation& expected,
      uint8_t maxPolls,
      uint8_t* outPolls);
  bool pollUntilRetainedState(uint8_t activeConfigId,
                              uint8_t slot0ConfigId,
                              uint8_t slot1ConfigId,
                              uint8_t previousConfigId,
                              uint8_t activePrimarySlotIndex,
                              uint8_t freePrimarySlotCount,
                              uint8_t storedConfigCount,
                              bool selectedRunnable,
                              bool slot0Runnable,
                              bool slot1Runnable,
                              bool previousRunnable,
                              bool selectedSecurityEnabled,
                              bool slot0SecurityEnabled,
                              bool slot1SecurityEnabled,
                              bool previousSecurityEnabled,
                              bool selectedProcedureParamsApplied,
                              bool slot0ProcedureParamsApplied,
                              bool slot1ProcedureParamsApplied,
                              bool previousProcedureParamsApplied,
                              uint8_t maxPolls,
                              uint8_t* outPolls);
  bool pollUntilRetainedState(
      const BleCsControllerVprRetainedStateExpectation& expected,
      uint8_t maxPolls,
      uint8_t* outPolls);
  bool pumpCommands();
  bool poll();
  bool loopOnce();
  bool pollWithInitiatorLlControlBridge(
      BleRadio& radio,
      BleCsLlControlBridgePollResult* outResult = nullptr,
      uint32_t spinLimit = 400000UL);
  bool loopOnceWithInitiatorLlControlBridge(
      BleRadio& radio,
      BleCsLlControlBridgePollResult* outResult = nullptr,
      uint32_t spinLimit = 400000UL);
  bool pumpInitiatorLlControlWorkflowBridge(
      BleRadio& radio,
      BleCsLlControlBridgeWorkflowTracker* tracker = nullptr,
      BleCsLlControlBridgePollResult* outLastPoll = nullptr,
      uint16_t maxPolls = 1U,
      uint32_t spinLimit = 400000UL);
  /* Drains pending asynchronous controller events (e.g. the standalone CS Test
   * result stream) via the direct controller-service path. Use this, not
   * poll()/loopOnce(), to collect test results on handle 0x0FFF, because the
   * stream path feeds the connected-procedure session. Returns false if the
   * host is not begun. */
  bool drainPendingControllerEvents();
  bool consumeCompletedResult(BleCsControllerResultSource source,
                              const BleCsSubeventResult& result);
  bool consumeMode2ResultsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      const BleCsSubeventResultHeader& headerTemplate,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen);
  bool consumeConnectedMode2ResultsFromMeasurements(
      const BleCsChannelMeasurement* measurements,
      size_t count,
      uint8_t configId,
      uint8_t* localStepData,
      size_t localMaxStepDataLen,
      uint8_t* peerStepData,
      size_t peerMaxStepDataLen,
      uint8_t numAntennaPaths = 1U);

  bool ready() const;
  bool failed() const;
  bool estimateValid() const;
  const BleCsControllerVprHostState& vprState() const;
  const BleCsControllerStreamHostState& streamState() const;
  const BleCsControllerHostState& hostState() const;
  const BleCsControllerSessionState& sessionState() const;
  const BleCsControllerWorkflowState& workflowState() const;
  const BleCsSubeventResult& localResult() const;
  const BleCsSubeventResult& peerResult() const;
  const BleCsSubeventResult& completedLocalResult() const;
  const BleCsSubeventResult& completedPeerResult() const;
  uint8_t lastProcedureAbortReason() const;
  uint8_t lastSubeventAbortReason() const;
  bool lastRemoteFaeTableValid() const;
  const BleCsFaeTable& lastRemoteFaeTable() const;
  bool lastTestEndCompleteValid() const;
  const BleCsTestEndComplete& lastTestEndComplete() const;
  /* Standalone CS Test result stream (handle 0x0FFF). These report the most
   * recently reassembled test subevent and the count of completed test
   * procedures drained since directStartTest(). */
  bool lastTestResultValid() const;
  const BleCsSubeventResult& lastTestResult() const;
  uint16_t testResultCount() const;

  /* Cached remote capabilities populated by a successful
   * directReadRemoteSupportedCapabilities / V2 round-trip through
   * the controller. Returns false if no cached data is available
   * (not yet read or invalidated). */
  bool cachedRemoteCapabilitiesV1(BleCsControllerCapabilities* outCapabilities) const;
  bool cachedRemoteCapabilitiesV2(BleCsControllerCapabilities* outCapabilities) const;

  VprSharedTransportStream& transport();
  const VprSharedTransportStream& transport() const;

